<template>
  <div id="Details">
    <h1>人物详情</h1>
    <div v-if="$route.params.id === '1'">
      <h3>这是刘备的人物详情</h3>
      <p>汉昭烈帝刘备（161年－223年6月10日），字玄德，涿郡涿县（今河北省涿州市大树楼桑村） [128] 人，西汉中山靖王刘胜之后，三国时期蜀汉开国皇帝
        [2] （221年5月15日 [106] —223年6月10日 [41] 在位）、政治家。史家多称其为先主。
        刘备少年时拜卢植为师，而后参与镇压黄巾起义。因为自身实力有限，刘备在诸侯混战过程中屡遭失败，先后依附公孙瓒、陶谦、曹操、袁绍、刘表等多个诸侯。但因其始终坚持以德服人的行为准则，受到了四方名士的尊敬，至有陶谦、刘表等放弃让自己的儿子继承基业，而是选择将自己的领地徐州、荆州让给刘备统领。
        通过坚持不懈的努力，刘备于赤壁之战后，先后拿下荆州、益州，建立了蜀汉政权。而后因为关羽被东吴所害，刘备不听群臣劝阻，执意发动对吴国的战争，结果兵败夷陵，最终于章武三年（223年）病逝于白帝城，终年六十三岁，谥号昭烈皇帝，《晋书·王弥传》称之为烈祖
        [1] ，葬惠陵。
        刘备弘毅宽厚，知人待士，百折不挠，其临死前举国托付给诸葛亮的行为被陈寿赞为“古今之盛轨” [2]
        ，后世众多文艺作品以刘备为主角。成都武侯祠有汉昭烈庙为之纪念。
      </p>
    </div>
    <div v-if="$route.params.id === '2'">
      <h3>这是关羽的人物详情</h3>
      <p>关羽（？—220年），字云长，本字长生 [95] ，河东郡解县（今山西省运城市盐湖区解州镇）人。东汉末年名将。
        汉末亡命涿郡，与张飞从刘备起兵。刘备得徐州后，使关羽行太守事。建安五年（200年），曹操东进，击破刘备，关羽被俘，遂随曹操于官渡迎击袁绍军，刺袁绍大将颜良于万众之中，封汉寿亭侯，不久辞归刘备，后随刘备依附荆州牧刘表。
        建安十三年（208年），曹操入荆州，刘备率众南逃，关羽与之共至夏口。及曹操败于赤壁，刘备收江南诸郡，任命关羽为襄阳太守、荡寇将军。刘备西定益州，使关羽镇守荆州。建安二十年（215年），关羽尽逐孙权所置长沙、零陵、桂阳三郡长吏。建安二十四年（219年），拜为前将军，围攻曹操将征南将军曹仁于樊城，时值汉水泛滥，左将军于禁所督七军皆被淹没，又斩将军庞德，自许（今河南许昌）以南往往遥应，威震华夏。曹操派平寇将军徐晃往救，而吴乘机袭取江陵，关羽遂败走麦城（今湖北当阳东南），与儿子关平同为吴军俘杀。追谥壮缪侯。好《左传》，善待卒伍而骄于士大夫，以忠义见称于后世。
        [95]
        关羽去世后，民间尊为“关公”，历代朝廷多有褒封。清朝雍正时期，尊为“武圣”，与“文圣”孔子地位等同。在小说《三国演义》中，名列“五虎上将”之首，使用青龙偃月刀。毛宗岗称其为《演义》三绝中的“义绝”。在宗教文化方面，关羽被儒家尊为文衡帝君
        [107] ，被佛教尊为护法伽蓝菩萨（伽蓝神） [97] 、盖天古佛，被道教尊为协天大帝、翔汉天神等。 [98]</p>
    </div>
    <div v-if="$route.params.id === '3'">
      <h3>这是张飞的人物详情</h3>
      <p>张飞（？—221年），字益德（也作“翼德”），涿郡（今河北保定涿州市）人，三国时期蜀汉名将。
        张飞勇武过人，与关羽并称为“万人敌”。关羽年长数岁，张飞兄事之。公元184年黄巾起义爆发，刘备在涿县组织起了一支义勇军参与扑灭黄巾军的战争，张飞与关羽一起加入，随刘备辗转各地。三人情同兄弟，寝则同床，刘备出席各种宴会时，和关羽终日侍立在刘备身旁。公元196年因交恶曹豹而被吕布所破。吕布败亡之后，张飞被任命为中郎将。公元200年刘备衣带诏事情泄漏，率领关羽、张飞逃走，杀徐州刺史车胄。后刘备战败，关羽被擒，刘备与张飞投奔袁绍。公元208年刘备于长坂坡败退时，张飞仅率二十骑断后，据当阳桥厉声大喝，曹军无人敢逼近，刘备因此得以免难。
        [61]
        刘备入蜀后，张飞与诸葛亮、赵云进军西川，分定郡县。在抵达江州时义释了刘璋手下的巴郡太守严颜。在巴西之战中，击败魏国名将张郃。在武都之战中，兵败而还。刘备称帝后，张飞晋升为车骑将军、领司隶校尉，封西乡侯。同年，张飞因为暴而无恩，被部将范强、张达杀害。谥曰桓侯。</p>
    </div>
  </div>
</template>

<script>
export default {
  name: "DetailS"
}
</script>

<style lang="scss" scoped>
#Details {
  h1, h3 {
    text-align: center;
  }

  p {
    text-align: center;
    margin: 0 1%;
    padding: 1% 0;
  }
}
</style>